// 3. Напишите программу вычисления функции:
// x = f(a)  -  функция куба

Console.Write("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());
int x = a*a*a;
Console.WriteLine(x);